Repository: 84000/data-translation-memory
Catalog: Toh_97-The_Chapter_on_Manjusris_Magical_Display-v1.tmx
Source language: bo
Languages: en

source: གཏམ་གང་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་མ་ཡིན། སྤང་བར་བྱ་བའི་ཕྱིར་མ་ཡིན། བསྒོམ་པར་བྱ་བའི་ཕྱིར་མ་ཡིན། མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་མ་ཡིན་པ་དང་།
en: teachings that are not for the sake of knowledge, abandonment, cultivation, or actualization;

source: གཏམ་གང་ཐོབ་པར་བྱ་བའི་ཕྱིར་མ་ཡིན། མངོན་པར་རྟོགས་པར་བྱ་བའི་ཕྱིར་མ་ཡིན་པ་
en: and teachings that are not for the sake of attainment or realization.

source: !འདི་ནི་ལྷའི་བུ་དག་སྙིང་པོ་ཡོད་པའི་གཏམ་མོ། །
en: Divine being, those are pure, meaningful teachings.

source: འཇམ་དཔལ་གཏམ་འདི་ལྟ་བུ་རྗོད་པའི་ཚེ། མིག་གིས་མི་རྩོལ་བར་བྱ་བའི་ཕྱིར་བདུད་སྡིག་ཅན་འདིར་མི་འོང་བ་ནི་ངོ་མཚར་ཏོ། །
en: “Mañjuśrī, when you give advice like this, Māra will surely not come to create confusion. How wonderful!”

source: ཚིག་དེ་སྨྲས་ནས་རིང་པོར་མ་ལོན་པར་དེའི་མོད་ལ་བདུད་སྡིག་ཅན་སྟེང་གི་བར་སྣང་ལ་སྤྲིན་ཆེན་པོ་འཁྲུགས་པར་མངོན་པར་སྤྲུལ་ནས་སྒྲ་ཆེན་པོའི་ང་རོ་ཕྱུང་བ་དང་།
en: No sooner had he spoken than the Evil One, Māra, manifested as a giant storm cloud in the sky above that thundered with a loud roar.

source: དེས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དངངས་སྐྲག་ནས་སྒྲ་སྐད་ཀྱི་ང་རོ་འདི་ལྟ་བུ་སུ་ཞིག་གི་སྙམ་མོ། །
en: The entire assembly became frightened and thought, “Who roared like that?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One said to youthful Mañjuśrī,

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་བདུད་སྡིག་ཅན་གྱི་འགྱུར་བ་མཐོང་ངམ།
en: “Mañjuśrī, do you see the manifestation of the Evil One, Māra?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ།
en: Mañjuśrī replied,

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Blessed One, I see it.

source: བདེ་བར་གཤེགས་པ་མཐོང་ལགས་སོ། །
en: Well-Gone One, I see it.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེའི་ཚེ་བདུད་སྡིག་ཏོ་ཅན་བཅིང་བ་དམ་པོས་བཅིངས་ཏེ
en: Just then youthful Mañjuśrī ensnared the evil Māra with tight bonds.

source: སའི་སྟེང་དུ་ལྟུང་བ་དེ་ལྟ་བུའི་བསམ་པ་བསམས་པ་དང་། བདག་ནི་བཅིང་བ་དམ་པོས་བཅིངས་སོ། །བདག་ནི་བཅིང་བ་དམ་པོས་བཅིངས་སོ་ཞེས་སྒྲ་འབྱིན་ཏོ། །
en: Māra, worried that he was going to fall down to earth, cried out, “I have been tied too tightly! I have been tied too tightly!”

source: སྡིག་ཅན་བཅིང་བ་འདི་བས་ཆེས་དམ་པའི་འཆིང་བ་གཞན་ཡོད་དེ། དེས་ཁྱོད་རྟག་ཏུ་བཅིངས་ཀྱང་ཁྱོད་ཀྱིས་ཁོང་དུ་མ་ཆུད་དོ། །
en: “Evil One, there are other bonds that are far tighter than these. Although you have always been bound by them, you have not realized it.

source: དེ་ཡང་གང་ཞེ་ན་
en: What are they?

source: ངའོ་སྙམ་པའི་ང་རྒྱལ་གྱི་འཆིང་བ་དང་། ཕྱིན་ཅི་ལོག་གི་འཆིང་བ་དང་། སྲེད་པ་དང་ལྟ་བའི་འཆིང་བ་སྟེ།
en: They are the bond of the prideful thought ‘I am,’ the bond of misconception, and the bonds of craving and views.

source: སྡིག་ཅན་འདི་ནི་འཆིང་བ་འདི་བས་ཆེས་དམ་པའི་འཆིང་བ་དམ་པོ་གཞན་ཡིན་ཏེ།
en: Evil Māra, those are far tighter bonds than the ones in which I have now ensnared you.

source: དེས་ཁྱོད་རྟག་ཏུ་བཅིངས་ཀྱང་ཁོང་དུ་མ་ཆུད་དོ། །
en: Although they have always bound you, you have not realized it.”

source: བདུད་ཀྱིས་སྨྲས་པ།
en: Māra responded,

source: འཇམ་དཔལ་ཐོང་ཤིག་དང་བདག་གི་གནས་སུ་འགྲོའོ། །
en: “Mañjuśrī, let me go! I will return to my abode.

source: ཡང་བདུད་ཀྱི་ལས་མི་བྱའོ། །
en: I will not commit any demonic acts.”

source: སྡིག་ཅན་སངས་རྒྱས་ཀྱི་མཛད་པ་ཁྱོད་ཀྱིས་བྱ་དགོས་ན་ཁྱོད་ཅིའི་ཕྱིར་བཏང་།
en: “Evil One, if you are meant to do the work of the Buddha, why would I let you go?”

source: འཇམ་དཔལ། བདག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་བར་ཆད་བྱ་བའི་ཕྱིར་ཞུགས་པ་ཡིན་ན་བདག་གིས་སངས་རྒྱས་ཀྱི་མཛད་པ་ཇི་ལྟར་བྱ།
en: “Mañjuśrī, I am here to cause obstacles to the teachings of the Buddha, so how could I do the work of the Buddha?”

source: སྡིག་ཅན་གང་སངས་རྒྱས་ཀྱི་མཛད་པ་བདུད་བྱེད་དུ་གཞུག་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཐབས་དང་ཤེས་རབ་ཀྱི་ཤེས་པ་རྣམ་པར་སྤྲུལ་པའོ། །
en: “Evil One, to cause a māra to engage in the work of a buddha is a manifestation of the bodhisattvas’ skills and knowledge.

source: གང་སངས་རྒྱས་ཀྱིས་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་པ་འདི་ནི་ངོ་མཚར་མ་ཡིན་ཏེ།
en: A buddha who performs buddha activity is not remarkable.

source: གང་བདུད་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པ་འདི་ནི་རབ་ཏུ་ངོ་མཚར་ཏོ། །
en: A māra who performs buddha activity is truly amazing.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེའི་ཚེ་གང་སྡིག་ཅན་སངས་རྒྱས་ཀྱི་གཟུགས་དང་ལྡན་པ་དང་། སངས་རྒྱས་ཀྱི་སེང་གེའི་ཁྲི་ལ་འདུག་པ་དང་། སངས་རྒྱས་ཀྱི་སྤོབས་པ་དང་ལྡན་པར་འགྱུར་བའི་བྱིན་གྱི་རླབས་དེ་ལྟ་བུའི་བྱིན་གྱིས་བརླབས་སོ། །
en: Having said this, youthful Mañjuśrī transformed the evil Māra so that he obtained the appearance of a buddha, sat on the lion throne of a buddha, and had the eloquence of a buddha.

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ཚེ་དང་ལྡན་པ་དག་ཅི་དང་ཅི་འདོད་པ་ཁོ་བོ་ལ་དྲིས་ཤིག་དང་ཁོ་བོས་དྲིས་པ་ལུང་བསྟན་པས་ཁྱེད་ཀྱི་སེམས་རངས་པར་བྱའོ་ཞེས་ཚིག་དེ་སྐད་སྨྲས་སོ། །
en: Then the evil Māra said, “Venerable ones, ask me anything you wish. I will then answer and put your minds at ease.”

source: དེ་ནས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The elder Mahākāśyapa asked the evil Māra,

source: སྡིག་ཅན་དགེ་སློང་རྣལ་འབྱོར་སྤྱོད་པའི་འཆིང་བ་གང་ཡིན།
en: “Evil One, what are the bonds of a monk practitioner?”

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་བསམ་གཏན་གྱི་རོ་མྱོང་བར་བྱེད་པ་ནི་དགེ་སློང་རྣལ་འབྱོར་སྤྱོད་པའི་འཆིང་བའོ། །
en: “Venerable Mahākāśyapa, relishing the experience of concentration is a bond of a monk practitioner.

source: ཞི་གནས་དེ་ལ་ཆགས་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: Also, attachment to tranquility, practicing attainment in the sense source of neither perception nor nonperception,

source: སྟོང་པ་ཉིད་ལ་སྙིང་པོར་འདུ་ཤེས་པ་དང་། ལྟ་བར་སོང་བ་རྣམས་བསལ་བར་འདུ་ཤེས་པ་དང་།
en: perceiving an essence in emptiness, perceiving wrong views as something to eradicate,

source: མཚན་མ་མེད་པ་ལ་སྙིང་པོར་འདུ་ཤེས་པ་དང་། མཚན་མ་རྣམས་ལ་བསལ་བར་འདུ་ཤེས་པ་དང་།
en: perceiving an essence in the absence of marks, perceiving marks as something to eradicate,

source: སྨོན་པ་མེད་པ་ལ་སྙིང་པོར་འདུ་ཤེས་པ་དང་། སྨོན་ལམ་ལ་བསལ་བར་འདུ་ཤེས་པ་དང་།
en: perceiving an essence in the absence of wishes, perceiving wishes as something to eradicate,

source: མྱ་ངན་ལས་འདས་པ་ལ་སྙིང་པོར་འདུ་ཤེས་པ་དང་།
en: perceiving an essence in nirvāṇa, and

source: འཁོར་བ་ལ་བསལ་བར་འདུ་ཤེས་པ་འདི་དག་ནི་བཙུན་པ་འོད་སྲུང་ཆེན་པོ་དགེ་སློང་རྣལ་འབྱོར་སྤྱོད་པའི་འཆིང་བའོ། །
en: perceiving saṃsāra as something to eradicate—these are the bonds of a monk practitioner, venerable Mahākāśyapa.

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་ལྟ་བར་སོང་བ་བསལ་ནས་སྟོང་པ་ཉིད་བསྒོམ་པར་བྱ་བ་མ་ཡིན་གྱི། ལྟ་བར་སོང་བ་ཉིད་སྟོང་པ་ཉིད་དོ། །
en: Venerable Mahākāśyapa, emptiness is not something that must be cultivated once views have been eradicated—rather, wrong views are themselves emptiness.

source: མཚན་མ་བསལ་ནས་མཚན་མ་མེད་པ་བསྒོམ་པར་བྱ་བ་མ་ཡིན་གྱི། མཚན་མའི་ངོ་བོ་ཉིད་མཚན་མ་མེད་པའོ། །
en: The absence of marks is not something that must be cultivated once marks have been eradicated—rather, the very essence of marks is the absence of marks.

source: སྨོན་ལམ་བསལ་ནས་སྨོན་པ་མེད་པར་བསྒོམ་པར་བྱ་བ་མ་ཡིན་གྱི། སྨོན་ལམ་གྱི་ངོ་བོ་ཉིད་སྨོན་པ་མེད་པའོ། །
en: The absence of wishes is not something to be cultivated once wishes have been eradicated—rather, the very essence of wishes is the absence of wishes.

source: འཁོར་བ་བསལ་ནས་མྱ་ངན་ལས་འདས་པ་བསྒོམ་པར་བྱ་བ་མ་ཡིན་གྱི། འཁོར་བར་དམིགས་པ་ཉིད་མྱ་ངན་ལས་འདས་པའོ། །
en: Nirvāṇa is not something that must be cultivated once saṃsāra has been eradicated—rather, the very apprehension of saṃsāra is nirvāṇa.

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་ནི་འདུ་ཤེས་པ་དང་། རློམ་སེམས་དང་། མཚན་མ་ལ་དམིགས་པ་ཐམས་ཅད་ལ་མི་སྤྱོད་པ་སྟེ།
en: Venerable Mahākāśyapa, nirvāṇa does not partake of any notions, assumptions, or apprehension of marks.

source: མྱ་ངན་ལས་འདས་པ་ནི་སྐྱེ་བ་དང་། འཇིག་པ་དང་། ཟད་པ་ལས་མ་ཡིན་གྱི། རང་བཞིན་གྱིས་སྐྱེ་བ་མེད་པ་ཉིད་མྱ་ངན་ལས་འདས་པའོ། །
en: Nirvāṇa is nothing other than birth, destruction, and exhaustion—and yet, nonorigination is itself, by nature, nirvāṇa.”

source: བསྟན་པ་འདི་བཤད་པ་ན་དགེ་སློང་ལྔ་བརྒྱ་ཉེ་བར་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: When this teaching was given, five hundred monks had their minds liberated from defilements, with no further appropriation.

source: དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་དགེ་སློང་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་དག་སུས་བཏུལ།
en: The elder Subhūti addressed those monks saying, “Noble ones, who has trained you?”

source: དགེ་སློང་དེ་དག་གིས་སྨྲས་པ། གང་ཐོབ་པ་ཡང་མེད་པ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ཡང་མེད་པས་སོ། །
en: The monks responded, “One who has no attainment and no complete awakening.”

source: རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Subhūti inquired,

source: བཏུལ་བ་དེ་ཇི་ལྟ་བུ།
en: “What is that training like?”

source: སྨྲས་པ།
en: The monks replied,

source: ཇི་ལྟར་གནས་པ་ཉིད་ཀྱི་ཕྱིར་ཆུང་ཟད་ཀྱང་ཁྲིད་པ་ཡང་མེད། མ་ཁྲིད་པ་ཡང་མེད་དེ།
en: “There is no guidance aimed at the abiding nature, yet there is also no absence of such guidance;

source: ཇི་ལྟར་གནས་པ་བཞིན་དུ་ཤེས་པ་དང་། བསྐྱེད་པ་ཡང་མེད། བཀག་པ་ཡང་མེད་དེ། མཉམ་པ་ཉིད་དུ་ཤེས་པ་དེ་ལྟར་བདག་ཅག་བཏུལ་ཏོ། །
en: it is known, just as it is. There is neither producing nor obstructing it; things are known to be sameness.”

source: དགེ་སློང་དེ་དག་གིས་བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་བུ་སྟོང་ཉིས་བརྒྱ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ། །
en: When those monks gave that teaching, twelve hundred gods purified the Dharma eye regarding phenomena, so that it became clear and immaculate.

source: གནས་བརྟན་རབ་འབྱོར་གྱིས་གཞན་ཡང་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Elder Subhūti then inquired of evil Māra,

source: སྡིག་ཅན་ཇི་ལྟར་ན་དགེ་སློང་སྦྱིན་གནས་ཡིན།
en: “Evil One, what monks are worthy of generosity?”

source: བཙུན་པ་རབ་འབྱོར་ནམ་དགེ་སློང་ལེན་པ་ཡང་མེད་དེ། ནོད་པ་ཡང་མེད་ལ་དད་ཅིང་དང་བ་ཐམས་ཅད་ལས་ཀྱང་ཡོངས་སུ་སྤྱོད་པ་ནའོ། །
en: “Venerable Subhūti, those monks who do not receive or accept anything, but sustain themselves exclusively on faith and devotion.

source: བཙུན་པ་རབ་འབྱོར་གང་དགེ་སློང་གང་ལ་བྱིན་པ་དེ་ལ་སྒྱུ་མའི་བློ་དང་། གང་ལེན་པ་དེ་ལ་མིག་ཡོར་གྱི་བློ་དང་། ཉེ་བར་ལེན་པའི་སེམས་དང་། ཉེ་བར་ལེན་པ་མེད་པའི་སེམས་ཀྱིས་ཀྱང་ཡོངས་སུ་མི་སྤྱོད་པའི་དགེ་སློང་དེ་ལྟ་བུ་ནི་སྦྱིན་པའི་གནས་ཡིན་ནོ། །
en: Venerable Subhūti, monks are worthy of generosity when they regard themselves, the recipient monks, as illusions, and the offering as a hallucination, and they partake of it with neither grasping nor the absence of grasping.”

source: ཤ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ། སྡིག་ཅན་བཅོམ་ལྡན་འདས་ཀྱིས་ཏིང་ངེ་འཛིན་འཁྲུགས་པ་མེད་པར་གསུངས་པ་གང་ཡིན།
en: Śāradvatīputra inquired, “Evil One, what is the Blessed One’s teaching on the imperturbable absorption?”

source: བྱང་ཆུབ་སེམས་དཔའ་ཏིང་ངེ་འཛིན་གང་ལ་བརྟེན་ནས་ཤིན་ཏུ་ཟད་པའི་ཕྱིར་ཟད་པ་ཡང་ཟད་པར་མི་བྱེད།
en: “It is the absorption by which bodhisattvas do not bring even exhaustion to exhaustion, since it is entirely exhausted.

source: རང་བཞིན་གྱིས་མ་སྐྱེས་པའི་ཕྱིར་མ་སྐྱེས་པ་ཡང་མི་སྐྱེད།
en: Likewise, they do not produce even the unborn, since it is naturally unborn;

source: མྱོང་བ་མེད་པ་ཡང་མྱོང་བར་མི་བྱེད་དེ།
en: nor do they invoke an experience of even the absence of experience,

source: ཆོས་ཐམས་ཅད་ཀྱང་རང་བཞིན་གྱིས་སྙོམས་པར་ཞུགས་པར་ཤེས་ལ།
en: for they know all phenomena to be naturally attained.

source: ཤེས་ནས་ཀྱང་ཚོར་བ་ཐམས་ཅད་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་འཇུག་ཅིང་མཉམ་པར་ཡང་མཐོང་ལ་
en: Knowing this, they reach the attainment in which all feelings are the attainment of cessation and are seen to be sameness.

source: ཆུང་ཟད་ཀྱང་མཐོང་བ་ཡང་མེད། མི་མཐོང་བ་ཡང་མེད་པ་འདི་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་ཏིང་ངེ་འཛིན་འཁྲུགས་པ་མེད་པར་གསུངས་པའོ། །
en: In this there is nothing whatsoever to be seen, nor is there anything that is not seen. This is the Blessed One’s teaching on the imperturbable absorption.”

source: མཽད་གལ་གྱི་བུས་སྨྲས་པ།
en: Maudgalyāyana inquired,

source: སྡིག་ཅན་ཇི་ལྟར་ན་དགེ་སློང་སེམས་ཐམས་ཅད་ལ་དབང་ཐོབ་པ་ཡིན།
en: “Evil One, how do monks attain power over all mind states?”

source: བཙུན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ནམ་དགེ་སློང་ཆོས་ཐམས་ཅད་ལ་སེམས་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་དུ་ཤེས་ལ། རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད་ཅིང་
en: “Venerable Mahāmaudgalyāyana, this occurs when monks understand all phenomena to have the characteristics of the liberated mind, without being attached to the characteristics of liberation.

source: སེམས་གཟོད་མ་ནས་རྣམ་པར་གྲོལ་བ་ཤེས་ལ། འཆིང་བར་ཡང་མི་བྱེད། གྲོལ་བར་ཡང་མི་བྱེད།
en: It occurs when they know that the mind is primordially liberated and beyond bondage and liberation.

source: སེམས་གཟུགས་མེད་པས་ཆོས་ཐམས་ཅད་གཟུགས་མེད་པར་ཤེས།
en: It occurs when they know that all phenomena are without form, because the mind is without form.

source: སེམས་གནས་པ་མེད་པས་ཆོས་ཐམས་ཅད་གནས་པ་མེད་པར་མཐོང་།
en: It occurs when they see that all phenomena do not abide, because the mind does not abide.

source: སེམས་འཛིན་པ་མེད་པས་ཆོས་ཐམས་ཅད་འཛིན་པ་མེད་པར་ཤེས་
en: It occurs when they know that all phenomena cannot be grasped, because the mind cannot be grasped.

source: ཀྱང་སེམས་ཀྱིས་སེམས་ཤེས་པ་ཡང་མེད་ལ། སེམས་ཀྱིས་ངོ་བོ་ཉིད་ཀྱི་རང་བཞིན་གྱིས་ཆོས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་རང་བཞིན་ཡང་ཤེས་ཤིང་།
en: And yet, even as there is no knowing the mind by means of the mind, it occurs when they know the essential nature of the realm of phenomena by means of the essential nature of the mind.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་རང་བཞིན་གྱིས་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པར་དབང་ཐོབ་པ་ནི་མོས་པའི་རྫུ་འཕྲུལ་དང་ལྡན་པ་ཡིན་ཏེ
en: It occurs when they attain the power of independence by means of the essential nature of the realm of phenomena. This is also the attainment of the miraculous powers of intention.

source: བཙུན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དགེ་སློང་དེ་ལྟ་བུ་ནི་སེམས་ཐམས་ཅད་ལ་དབང་ཐོབ་པ་ཡིན་ནོ། །
en: Reverend Mahāmaudgalyāyana, monks like this have power over all mind states.”

source: གང་པོས་སྨྲས་པ།
en: Pūrṇa inquired,

source: སྡིག་ཅན་ཇི་ལྟར་ན་དགེ་སློང་ཡོངས་སུ་དག་པར་ཆོས་སྟོན་པ་ཡིན།
en: “Evil One, how do monks teach the Dharma purely?”

source: བཙུན་པ་གང་པོ་ནམ་དགེ་སློང་གིས་གཞན་ལས་ཆོས་ཐམས་ཅད་ཤེས་ཀྱང་གཞན་དང་གཞན་མ་ཡིན་པའི་སེམས་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད།
en: “Venerable Pūrṇa, monks do so by not being attached to any notions of other or not other, even though they know all phenomena from each other.

source: ཆོས་ཐམས་ཅད་ཀྱང་སྒྲོ་བཏགས་པར་ཡང་སྟོན། ཡི་གེ་དང་། སྐད་དང་། དབྱངས་དང་། ཚིག་གི་ལམ་ཐམས་ཅད་ཀྱང་བྲག་ཅ་ལྟ་བུར་ཤེས།
en: They do so by teaching that all phenomena are projections, and by understanding that all forms of syllables, speech, voices, and words are like echoes.

source: ཆོས་ཉན་པ་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་སྐྱེས་བུ་ལྟར་མཐོང་།
en: They do so by seeing all those who listen to the Dharma as illusory beings,

source: གང་གི་ལུས་ཀྱི་རྣམ་པར་རིག་བྱེད་ཀྱང་ཆུ་ཟླ་དང་འདྲ་བར་མཐོང་།
en: and by seeing the manifestations of their bodies to be like the moon reflected in water.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྟོག་པ་ལས་བྱུང་བར་ཤེས།
en: They do so by knowing that all afflictions arise from superimpositions.

source: ཆོས་འགའ་ཞིག་གཟུང་བའི་ཕྱིར་རམ། དོར་བའི་ཕྱིར་རམ། ཤིན་ཏུ་བཟླ་བའི་ཕྱིར་རམ། ཐོབ་པར་བྱ་བའི་ཕྱིར་ཡང་ཆོས་མི་སྟོན།
en: They do so by not teaching the Dharma for the sake of possessing, discarding, avoiding, or obtaining anything.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་པོ་རྣམས་ལ་ཡང་དབང་ཐོབ་ཅིང་ལེགས་སོ་ཞེས་བྱ་བ་ལ་ཡང་རེ་བ་མེད་ལ།
en: They do so without any hope of attaining mastery of the four types of correct understanding, and without any hope for approval.

source: ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་ཅིང་རང་གི་སེམས་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པར་ཤེས་ཏེ
en: They do so by teaching the Dharma without asking for material possessions, and by knowing that, since their own minds are intrinsically pure, the minds of all beings are also intrinsically pure.

source: སེམས་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པར་ཤེས་ནས་ཕུང་པོའི་བདུད་ལ་དབེན་པར་མཐོང་བ་དང་།
en: Knowing that the mind is intrinsically pure, they see the māra of the aggregates as void.

source: ཉོན་མོངས་པའི་བདུད་ལ་བཅོས་མར་འདུ་ཤེས་པ་དང་།
en: They perceive the māra of the afflictions to be fabricated.

source: འཆི་བདག་གི་བདུད་ལ་མ་སྐྱེས་པ་དང་། མི་སྐྱེ་བར་གནས་པ་དང་།
en: They know that the māra of the Lord of Death is unborn and beyond birth.

source: ལྷའི་བུའི་བདུད་ལ་གཡོ་བ་དང་། རློམ་སེམས་ཐམས་ཅད་དང་བྲལ་བར་གྱུར་པ་ཡིན་ཏེ
en: With regard to the māra of the gods, these monks are unshakable and free of all assumptions.

source: དགེ་སློང་དེ་ལྟ་བུ་ནི་ཡོངས་སུ་དག་པར་ཆོས་སྟོན་པ་ཡིན་ནོ། །
en: Monks like this are pure teachers of the Dharma.”

source: ཉེ་བར་འཁོར་གྱིས་སྨྲས་པ།
en: Upāli inquired,

source: སྡིག་ཅན་ཇི་ལྟར་ན་དགེ་སློང་འདུལ་བ་འཛིན་པ་ཡིན།
en: “Evil One, how do monks uphold the Vinaya?”

source: བཙུན་པ་ཉེ་བར་འཁོར་དགེ་སློང་གིས་ནམ་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་དུལ་བར་ཤེས་ཏེ།
en: “Venerable Upāli, when monks know all phenomena to be fully tamed,

source: ཉེས་པ་རྣམས་ཀྱི་ཐོག་མའི་སྔོན་གྱི་མཐའ་ཡང་དབེན་པའི་མཐར་ཤེས་ལ།
en: they understand that the limit of the beginning of transgression is identical with the limit of disengagement.

source: ཉེས་པ་བྱུང་བ་རྣམས་ཀྱི་འགྱོད་པ་ཡང་སེལ་ཅིང་དམ་པོར་མི་བྱེད་དེ།
en: They clear away their remorse over the arising of faults and are no longer so strict.

source: དེ་དག་གང་གིས་མཚམས་མེད་པ་རྣམས་ཀྱང་རྣམ་པར་གནོན་ན། ཆོ་ག་དང་ཚུལ་ཁྲིམས་ལ་ལོག་པར་ཞུགས་པ་ཕྲན་ཚེགས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་དེ་ལྟ་བུའི་ཆོས་ཀྱི་ཚུལ་གྱི་རྣམ་པ་ཡང་ཉེ་བར་སྒྲུབ།
en: Since they can overcome even the acts with immediate retribution, there is no need to mention minor wrongdoing related to behavior and discipline. As such, they accomplish proper Dharma conduct.

source: ཉོན་མོངས་པ་འདུལ་བ་ལ་ཡང་མཁས།
en: They are experts at taming the afflictions.

source: བློ་བུར་གྱི་ཉོན་མོངས་པ་རྣམས་ལ་ཡང་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པ་མ་ཡིན་པ་དང་། འབྱུང་བར་འདུ་ཤེས།
en: They perceive that temporary afflictions are not defiled, and that they arise.

source: ཉོན་མོངས་པར་ནང་དུ་ཡང་མི་སྟོན། ཕྱི་རོལ་དུ་ཡང་མ་ཡིན། གཉི་ག་མེད་པར་ཡང་མ་ཡིན་ཏེ།
en: They do not teach afflictions as being inside, outside, or neither.

source: ཉོན་མོངས་པ་ཁོང་དུ་ཆུད་པ་ཉིད་ཉོན་མོངས་པ་མེད་པར་ཤེས་ཤིང་ཉོན་མོངས་པ་ཡང་མི་སེལ། ཉོན་མོངས་པ་མེད་པ་ཡང་མི་སྒྲུབ།
en: They know that such an understanding of the afflictions is to know their nonexistence, so they do not try to eliminate them or make them disappear.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་སྤྲིན་འདྲ་བར་ཤེས་ཏེ། ཡེ་ཤེས་དང་ལྷག་མཐོང་གི་རླུང་གིས་གཏོར་ནས་ཕྱོགས་དང་ཡུལ་དུ་འགྲོ་བ་ཡང་མེད་གནས་པ་ཡང་མེད་པ་དང་།
en: Rather, they know all afflictions to be like clouds, in that they use the wind of wisdom and special insight to scatter them in a way that they do not go anywhere or to any place, nor do they remain.

source: ཉོན་མོངས་པ་རྣམས་ནི་ཆུ་ཟླ་དང་འདྲ་སྟེ། ཡོངས་སུ་རྟོག་པའི་གཟུགས་བརྙན་གྱིས་བཞིན་ཉེ་བར་སྟོན་པ་དང་།
en: They know that afflictions are like the moon in water, in that they show their faces through the reflections of superimpositions.

source: ཉོན་མོངས་པ་རྣམས་ནི་མུན་པའི་སྤྱོད་ཡུལ་ཏེ། ཤེས་རབ་ཀྱི་སྒྲོན་མས་མི་སྣང་བ་སྣང་བར་བྱེད་པ་དང་།
en: They know that afflictions are like a dark realm, such that they use the lantern of wisdom to illuminate the darkness.

source: ཉོན་མོངས་པ་རྣམས་ནི་ཆོམ་རྐུན་དང་། མཁའ་འགྲོ་མ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་འདྲ་སྟེ། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པས་བརྟགས་ན་གནས་པ་མ་ཡིན་པ་དང་།
en: They know that afflictions are like thieves, ḍākinīs, yakṣas, and rākṣasas, in that if one investigates properly, they do not remain.

source: ཉོན་མོངས་པ་རྣམས་ནི་གླགས་ཚོལ་བ་སྟེ། ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པས་འཕེལ་བ་དང་།
en: They know that afflictions always exploit our vulnerabilities, in that they proliferate with improper mental engagement.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཤེས་པས་ཡིད་ལ་འཇུག་པར་མི་བྱེད་པས་
en: They know that, through the knowledge of emptiness, the absence of marks, and the absence of wishes, one prevents afflictions from entering the mind.

source: སུས་ཉོན་མོངས་པ་རྣམས་འདི་འདྲ་བར་ཤེས་ཏེསེམས་ཅན་ཉོན་མོངས་པས་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པ་རྣམས་ལ་སྙིང་རྗེ་ཞིང་བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པ་མངོན་སུམ་དུ་གྱུར་པ་ན་
en: Thus, whoever knows afflictions to be as such has compassion for beings tormented by afflictions, and they clearly perceive that there is no self and no being. When this has occurred,

source: འདུལ་བ་འཛིན་པ་ཡང་དག་པ་ཞེས་བྱའོ། །
en: they are known as true upholders of the Vinaya.”

source: དེ་ལྟར་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་རང་རང་གི་འདོད་པ་བདུད་སྡིག་ཅན་དེ་ལ་ཀུན་དྲིས་ནས་བདུད་སྡིག་ཅན་གྱིས་ཀྱང་དེ་དག་ཐམས་ཅད་ཀྱི་དོན་གཏན་ལ་བབ་པར་བསྟན་པས་སེམས་རངས་པར་གྱུར་ཏོ། །
en: In this way, all the great hearers asked evil Māra the questions they wished, and evil Māra answered all of them conclusively, setting their minds at ease.

source: དེ་ནས་ལྷའི་བུ་མཚམས་བཟངས་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས། བདུད་སྡིག་ཅན་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Present in the assembly at that time was the god Susīma, who asked the evil Māra,

source: སྡིག་ཅན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདུད་ཀྱི་ལས་བཤད་ཟིན་གྱིས་ཁྱོད་ཀྱང་སྤོབས་པར་གྱིས་ཤིག །
en: “Evil One, youthful Mañjuśrī spoke about the workings of Māra in relation to the bodhisattvas, but would you please also clarify?

source: སྡིག་ཅན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདུད་ཀྱི་ལས་གང་།
en: Evil One, what are the workings of Māra for the bodhisattvas?”

source: སྡིག་ཅན་གྱིས་ལྷའི་བུ་མཚམས་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The Evil One replied to the god Susīma,

source: ལྷའི་བུ་ཉི་ཤུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདུད་ཀྱི་ལས་ཡང་དག་ཕུལ་ཡིན་ནོ། །
en: “Divine being, there are twenty particularly severe workings of Māra for the bodhisattvas.

source: ཉི་ཤུ་གང་ཞེ་ན།
en: What are those twenty?

source: རྣལ་འབྱོར་སྤྱོད་པ་རྣམ་པར་གྲོལ་བ་འདོད་ཅིང་འཁོར་བས་སྐྲག་པ་རྣམས་ལ་བསྙེན་པ་དང་། བསྟེན་པ་དང་། བསྙེན་བཀུར་བྱེད་པ་ནི་བདུད་ཀྱི་ལས་སོ། །
en: (1) Pleasing, serving, and venerating those practitioners who seek liberation and fear saṃsāra are the workings of Māra.

source: སྟོང་པ་ཉིད་ལ་སོ་སོར་རྟོག་ཅིང་སེམས་ཅན་ཡལ་བར་འདོར་བ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (2) Contemplating emptiness, yet forsaking beings, is the working of Māra.

source: འདུས་མ་བྱས་ལ་སོ་སོར་རྟོག་ཅིང་འདུས་བྱས་ཀྱི་དགེ་བའི་རྩ་བས་ཡོངས་སུ་སྐྱོ་བ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (3) Contemplating the unconditioned, yet being weary of conditioned roots of virtue, is the working of Māra.

source: བསམ་གཏན་སྐྱེད་ཅིང་བསམ་གཏན་ལས་རྣམ་པར་ལྡོག་པ་ཚོལ་བ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (4) Generating concentration, yet attempting to turn away from concentration, is the working of Māra.

source: ཆོས་སྟོན་ཀྱང་ཆོས་ཉན་པ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་མི་སྐྱེད་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (5) Teaching the Dharma, yet not having great compassion for the audience, is also the working of Māra.

source: ཡོན་ཏན་དང་ལྡན་པ་དང་སྦྱིན་གནས་ཚོལ་ཞིང་ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལ་ཁྲོ་བ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (6) Searching for those who have qualities and who are worthy of generosity, while harboring anger toward those who are immoral, is the working of Māra.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་གཏམ་སྟོན་ཅིང་ཐེག་པ་ཆེན་པོའི་གཏམ་འཆབ་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (7) Teaching the discourses of the hearers and solitary buddhas, while concealing the teachings of the Great Vehicle, is the working of Māra.

source: ཟབ་མོའི་གཏམ་འཆབ་ཅིང་གཏམ་སྣ་ཚོགས་སྟོན་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (8) Hiding the profound discourses, while teaching various other topics, is the working of Māra.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཤེས་ཀྱང་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་ཡོངས་སུ་མི་ཚོལ་བ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (9) Knowing the path of the bodhisattvas, yet not striving on the path of the perfections, is also the working of Māra.

source: རབ་ཏུ་བརྩོན་པའི་བསྔགས་པ་བརྗོད་ཀྱང་སེམས་ཅན་མི་བརྩོན་པ་རྣམས་མངོན་པར་མི་སྦྱོར་བ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (10) Praising those who are particularly diligent, while not coaxing beings who are not diligent, is also the working of Māra.

source: དགེ་བའི་རྩ་བ་སོགས་ཀྱང་བྱང་ཆུབ་ཀྱི་སེམས་མངོན་དུ་མི་བྱེད་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (11) Not actualizing the mind of awakening, despite having accumulated roots of virtue, is also the working of Māra.

source: ལྷག་མཐོང་གི་རྣལ་འབྱོར་དང་ལྡན་པར་གནས་ཀྱང་སེམས་ཅན་རྣམས་ལྷག་མཐོང་ཡང་དག་པར་འཛིན་དུ་མི་འཇུག་པ་ཡང་བདུད་ཀྱི་ལས་སོ། །
en: (12) Preventing others from grasping special insight, despite practicing special insight oneself, is also the working of Māra.
